Tekla Open API Reference for Tekla Structures 2025
Load.Spanning Property
 The load spanning.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Load.LoadSpanningEnum Spanning { get; set; }
Public Property Spanning As Load.LoadSpanningEnum
	Get
	Set
Property Value
Type: Load.LoadSpanningEnum
See Also
Reference
Load Class
Tekla.Structures.Model Namespace